src/main/java/ok/dht/test/slastin/report/wrk2/puts-25000.txt
Running 45s test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.874ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.86ms    3.19ms  22.48ms   89.92%
    Req/Sec    26.35k     2.44k   39.44k    74.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  789.00us
 75.000%    1.27ms
 90.000%    5.09ms
 99.000%   16.77ms
 99.900%   20.72ms
 99.990%   22.09ms
 99.999%   22.43ms
100.000%   22.50ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.023     0.000000            7         1.00
       0.188     0.100000        87997         1.11
       0.343     0.200000       175218         1.25
       0.494     0.300000       262760         1.43
       0.642     0.400000       350439         1.67
       0.789     0.500000       437627         2.00
       0.862     0.550000       481439         2.22
       0.935     0.600000       525215         2.50
       1.007     0.650000       569199         2.86
       1.077     0.700000       612890         3.33
       1.273     0.750000       656287         4.00
       1.508     0.775000       678047         4.44
       1.864     0.800000       699942         5.00
       2.355     0.825000       721787         5.71
       2.995     0.850000       743679         6.67
       3.843     0.875000       765545         8.00
       4.463     0.887500       776512         8.89
       5.095     0.900000       787409        10.00
       5.899     0.912500       798348        11.43
       6.755     0.925000       809313        13.33
       7.687     0.937500       820205        16.00
       8.263     0.943750       825760        17.78
       8.751     0.950000       831222        20.00
       9.447     0.956250       836620        22.86
      10.543     0.962500       842101        26.67
      11.879     0.968750       847553        32.00
      12.551     0.971875       850292        35.56
      13.151     0.975000       853046        40.00
      13.807     0.978125       855799        45.71
      14.519     0.981250       858480        53.33
      15.335     0.984375       861228        64.00
      15.735     0.985938       862610        71.11
      16.063     0.987500       863950        80.00
      16.495     0.989062       865345        91.43
      16.959     0.990625       866691       106.67
      17.423     0.992188       868080       128.00
      17.663     0.992969       868770       142.22
      17.919     0.993750       869431       160.00
      18.159     0.994531       870158       182.86
      18.399     0.995313       870790       213.33
      18.735     0.996094       871495       256.00
      18.911     0.996484       871822       284.44
      19.087     0.996875       872160       320.00
      19.295     0.997266       872525       365.71
      19.487     0.997656       872855       426.67
      19.647     0.998047       873193       512.00
      19.743     0.998242       873353       568.89
      19.951     0.998437       873523       640.00
      20.191     0.998633       873697       731.43
      20.463     0.998828       873858       853.33
      20.751     0.999023       874035      1024.00
      20.927     0.999121       874113      1137.78
      21.103     0.999219       874205      1280.00
      21.279     0.999316       874295      1462.86
      21.407     0.999414       874371      1706.67
      21.551     0.999512       874465      2048.00
      21.599     0.999561       874500      2275.56
      21.695     0.999609       874540      2560.00
      21.743     0.999658       874584      2925.71
      21.791     0.999707       874632      3413.33
      21.855     0.999756       874669      4096.00
      21.935     0.999780       874693      4551.11
      21.983     0.999805       874719      5120.00
      22.015     0.999829       874738      5851.43
      22.047     0.999854       874763      6826.67
      22.063     0.999878       874775      8192.00
      22.079     0.999890       874786      9102.22
      22.095     0.999902       874796     10240.00
      22.127     0.999915       874813     11702.86
      22.143     0.999927       874817     13653.33
      22.191     0.999939       874831     16384.00
      22.207     0.999945       874836     18204.44
      22.223     0.999951       874841     20480.00
      22.255     0.999957       874845     23405.71
      22.287     0.999963       874849     27306.67
      22.335     0.999969       874856     32768.00
      22.351     0.999973       874858     36408.89
      22.367     0.999976       874863     40960.00
      22.367     0.999979       874863     46811.43
      22.383     0.999982       874866     54613.33
      22.399     0.999985       874869     65536.00
      22.399     0.999986       874869     72817.78
      22.415     0.999988       874871     81920.00
      22.431     0.999989       874873     93622.86
      22.431     0.999991       874873    109226.67
      22.447     0.999992       874875    131072.00
      22.447     0.999993       874875    145635.56
      22.463     0.999994       874878    163840.00
      22.463     0.999995       874878    187245.71
      22.463     0.999995       874878    218453.33
      22.463     0.999996       874878    262144.00
      22.463     0.999997       874878    291271.11
      22.479     0.999997       874879    327680.00
      22.479     0.999997       874879    374491.43
      22.479     0.999998       874879    436906.67
      22.495     0.999998       874881    524288.00
      22.495     1.000000       874881          inf
#[Mean    =        1.861, StdDeviation   =        3.190]
#[Max     =       22.480, Total count    =       874881]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1124974 requests in 45.00s, 71.88MB read
Requests/sec:  24999.74
Transfer/sec:      1.60MB