src/main/java/ok/dht/test/slastin/report/wrk2/puts-26000.txt
Running 45s test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 3.978ms, rate sampling interval: 23ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.72ms    6.05ms  41.15ms   92.73%
    Req/Sec    26.60k     1.85k   37.50k    82.30%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  777.00us
 75.000%    1.32ms
 90.000%    6.15ms
 99.000%   32.80ms
 99.900%   39.46ms
 99.990%   40.83ms
 99.999%   41.12ms
100.000%   41.18ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.023     0.000000            2         1.00
       0.185     0.100000        91271         1.11
       0.338     0.200000       182307         1.25
       0.487     0.300000       273324         1.43
       0.632     0.400000       364352         1.67
       0.777     0.500000       455324         2.00
       0.849     0.550000       500695         2.22
       0.921     0.600000       546348         2.50
       0.993     0.650000       592127         2.86
       1.063     0.700000       637479         3.33
       1.320     0.750000       682696         4.00
       1.668     0.775000       705427         4.44
       2.181     0.800000       728244         5.00
       2.841     0.825000       750975         5.71
       3.785     0.850000       773701         6.67
       4.775     0.875000       796496         8.00
       5.367     0.887500       807829         8.89
       6.151     0.900000       819203        10.00
       7.111     0.912500       830613        11.43
       8.447     0.925000       841960        13.33
      11.751     0.937500       853338        16.00
      14.327     0.943750       859028        17.78
      16.751     0.950000       864720        20.00
      19.679     0.956250       870439        22.86
      21.119     0.962500       876109        26.67
      22.927     0.968750       881776        32.00
      23.935     0.971875       884632        35.56
      25.263     0.975000       887461        40.00
      26.527     0.978125       890338        45.71
      27.423     0.981250       893153        53.33
      28.639     0.984375       895994        64.00
      29.471     0.985938       897425        71.11
      30.287     0.987500       898855        80.00
      31.631     0.989062       900263        91.43
      33.567     0.990625       901683       106.67
      35.135     0.992188       903142       128.00
      35.583     0.992969       903850       142.22
      36.031     0.993750       904535       160.00
      36.383     0.994531       905246       182.86
      36.799     0.995313       906005       213.33
      37.311     0.996094       906697       256.00
      37.567     0.996484       907074       284.44
      37.791     0.996875       907397       320.00
      37.983     0.997266       907736       365.71
      38.207     0.997656       908127       426.67
      38.399     0.998047       908447       512.00
      38.527     0.998242       908623       568.89
      38.655     0.998437       908812       640.00
      38.847     0.998633       908973       731.43
      39.167     0.998828       909158       853.33
      39.487     0.999023       909347      1024.00
      39.647     0.999121       909425      1137.78
      39.743     0.999219       909513      1280.00
      39.935     0.999316       909610      1462.86
      40.063     0.999414       909686      1706.67
      40.223     0.999512       909787      2048.00
      40.287     0.999561       909819      2275.56
      40.415     0.999609       909871      2560.00
      40.479     0.999658       909928      2925.71
      40.543     0.999707       909967      3413.33
      40.639     0.999756       910001      4096.00
      40.671     0.999780       910034      4551.11
      40.703     0.999805       910059      5120.00
      40.735     0.999829       910077      5851.43
      40.767     0.999854       910099      6826.67
      40.799     0.999878       910116      8192.00
      40.831     0.999890       910127      9102.22
      40.863     0.999902       910137     10240.00
      40.895     0.999915       910149     11702.86
      40.927     0.999927       910170     13653.33
      40.927     0.999939       910170     16384.00
      40.927     0.999945       910170     18204.44
      40.959     0.999951       910185     20480.00
      40.959     0.999957       910185     23405.71
      40.959     0.999963       910185     27306.67
      40.991     0.999969       910189     32768.00
      41.023     0.999973       910194     36408.89
      41.023     0.999976       910194     40960.00
      41.055     0.999979       910198     46811.43
      41.087     0.999982       910202     54613.33
      41.119     0.999985       910207     65536.00
      41.119     0.999986       910207     72817.78
      41.119     0.999988       910207     81920.00
      41.119     0.999989       910207     93622.86
      41.151     0.999991       910212    109226.67
      41.151     0.999992       910212    131072.00
      41.151     0.999993       910212    145635.56
      41.151     0.999994       910212    163840.00
      41.151     0.999995       910212    187245.71
      41.151     0.999995       910212    218453.33
      41.183     0.999996       910216    262144.00
      41.183     1.000000       910216          inf
#[Mean    =        2.716, StdDeviation   =        6.050]
#[Max     =       41.152, Total count    =       910216]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1169970 requests in 45.00s, 74.76MB read
Requests/sec:  25999.43
Transfer/sec:      1.66MB